Revit 2027 API
ZoneEquipment.GetAssociatedZoneEquipment Method
Overload List
Name | Description
GetAssociatedZoneEquipment(Document, ElementId) |  Gets the associated zone equipment of the specified analytical space.
GetAssociatedZoneEquipment(Document, ISet<ElementId>) |  Gets the associated zone equipment of all specified analytical spaces.
Top
See Also
Reference
ZoneEquipment Class
Autodesk.Revit.DB.Mechanical Namespace